Model: "sequential_22"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rescaling_12 (Rescaling)     (None, 32, 32, 3)         0         
_________________________________________________________________
conv2d_37 (Conv2D)           (None, 30, 30, 32)        896       
_________________________________________________________________
max_pooling2d_40 (MaxPooling (None, 15, 15, 32)        0         
_________________________________________________________________
dense_57 (Dense)             (None, 15, 15, 128)       4224      
_________________________________________________________________
flatten_22 (Flatten)         (None, 28800)             0         
_________________________________________________________________
dense_58 (Dense)             (None, 64)                1843264   
_________________________________________________________________
dense_59 (Dense)             (None, 64)                4160      
=================================================================
Total params: 1,852,544
Trainable params: 1,852,544
Non-trainable params: 0
_________________________________________________________________
