Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rescaling_5 (Rescaling)      (None, 32, 32, 3)         0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 3072)              0         
_________________________________________________________________
dense_19 (Dense)             (None, 256)               786688    
_________________________________________________________________
dense_20 (Dense)             (None, 32)                8224      
_________________________________________________________________
dense_21 (Dense)             (None, 10)                330       
=================================================================
Total params: 795,242
Trainable params: 795,242
Non-trainable params: 0
_________________________________________________________________
