Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_3 (Conv2D)            (None, 30, 30, 64)        1792      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 15, 15, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 13, 13, 32)        18464     
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 6, 6, 32)          0         
_________________________________________________________________
dense_12 (Dense)             (None, 6, 6, 128)         4224      
_________________________________________________________________
flatten_4 (Flatten)          (None, 4608)              0         
_________________________________________________________________
dense_13 (Dense)             (None, 64)                294976    
_________________________________________________________________
dense_14 (Dense)             (None, 10)                650       
=================================================================
Total params: 320,106
Trainable params: 320,106
Non-trainable params: 0
_________________________________________________________________
