Model: "sequential_21"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_35 (Conv2D)           (None, 14, 14, 64)        1792      
_________________________________________________________________
max_pooling2d_37 (MaxPooling (None, 7, 7, 64)          0         
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 5, 5, 64)          36928     
_________________________________________________________________
max_pooling2d_38 (MaxPooling (None, 2, 2, 64)          0         
_________________________________________________________________
max_pooling2d_39 (MaxPooling (None, 1, 1, 64)          0         
_________________________________________________________________
flatten_21 (Flatten)         (None, 64)                0         
_________________________________________________________________
dense_55 (Dense)             (None, 128)               8320      
_________________________________________________________________
dense_56 (Dense)             (None, 64)                8256      
=================================================================
Total params: 55,296
Trainable params: 55,296
Non-trainable params: 0
_________________________________________________________________
