Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rescaling_4 (Rescaling)      (None, 32, 32, 3)         0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 3072)              0         
_________________________________________________________________
dense_15 (Dense)             (None, 64)                196672    
_________________________________________________________________
dense_16 (Dense)             (None, 128)               8320      
_________________________________________________________________
dense_17 (Dense)             (None, 256)               33024     
_________________________________________________________________
dense_18 (Dense)             (None, 10)                2570      
=================================================================
Total params: 240,586
Trainable params: 240,586
Non-trainable params: 0
_________________________________________________________________
