Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rescaling_2 (Rescaling)      (None, 16, 16, 3)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 14, 14, 32)        896       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 32)          0         
_________________________________________________________________
dense_6 (Dense)              (None, 7, 7, 128)         4224      
_________________________________________________________________
flatten_2 (Flatten)          (None, 6272)              0         
_________________________________________________________________
dense_7 (Dense)              (None, 64)                401472    
_________________________________________________________________
dense_8 (Dense)              (None, 10)                650       
=================================================================
Total params: 407,242
Trainable params: 407,242
Non-trainable params: 0
_________________________________________________________________
