Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rescaling_6 (Rescaling)      (None, 32, 32, 3)         0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 30, 30, 32)        896       
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 15, 15, 32)        0         
_________________________________________________________________
dense_27 (Dense)             (None, 15, 15, 128)       4224      
_________________________________________________________________
flatten_10 (Flatten)         (None, 28800)             0         
_________________________________________________________________
dense_28 (Dense)             (None, 64)                1843264   
_________________________________________________________________
dense_29 (Dense)             (None, 10)                650       
=================================================================
Total params: 1,849,034
Trainable params: 1,849,034
Non-trainable params: 0
_________________________________________________________________
