Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rescaling_1 (Rescaling)      (None, 8, 8, 3)           0         
_________________________________________________________________
conv2d (Conv2D)              (None, 6, 6, 32)          896       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 3, 3, 32)          0         
_________________________________________________________________
dense_3 (Dense)              (None, 3, 3, 128)         4224      
_________________________________________________________________
flatten_1 (Flatten)          (None, 1152)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 64)                73792     
_________________________________________________________________
dense_5 (Dense)              (None, 10)                650       
=================================================================
Total params: 79,562
Trainable params: 79,562
Non-trainable params: 0
_________________________________________________________________
